Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.SetAsCurrentRevision Method (ReferenceModel.Revision)
 Sets the given revision as current revision.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetAsCurrentRevision(
	ReferenceModel.Revision revision
)
Public Function SetAsCurrentRevision (
	revision As ReferenceModel.Revision
) As Boolean
Parameters
revision
Type: Tekla.Structures.Model.ReferenceModel.Revision
The revision to be set as current.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Tekla.Structures.Model.ReferenceModel.SetAsCurrentRevision(Tekla.Structures.Model.ReferenceModel.Revision)"]
See Also
Reference
ReferenceModel Class
SetAsCurrentRevision Overload
Tekla.Structures.Model Namespace